app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC
---
  def index
    @tasks = Task.all.order(:id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show

    id = params[:id].to_i
    @task = Task.find_by(id: id)

INSERT INTO "tasks" ("name", "description", "completion_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Task Four"], ["description", "imcomplete"], ["completion_date", ""], ["created_at", "2018-09-21 17:18:51.290067"], ["updated_at", "2018-09-21 17:18:51.290067"]]
---
  def create
    @task = Task.new(task_params) #instantiate a new task

    if @task.save # save returns true if the database insert succeeds

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit

    @task = Task.find_by(id: params[:id].to_i)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "do homework"], ["completion_date", ""], ["updated_at", "2018-09-21 22:50:11.436839"], ["id", 2]]
---
  def update
    @task = Task.find_by(id: params[:id].to_i)
    @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
---
  def destroy
    @task = Task.find_by(id: params[:id].to_i)
    @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-21"], ["updated_at", "2018-09-21 21:40:02.072608"], ["id", 9]]
---
  def mark_complete

    @task = Task.find_by(id: params[:id].to_i)
    if @task.completion_date == nil
      new_date = "#{Date.today}"
    else
      new_date = nil
    end

    @task.update(completion_date: new_date)